In [1]:
import pandas as pd
import numpy as np

# Series

In [2]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [3]:
# create a series 
display(pd.Series(data = my_data))

display('-'*60)
display(pd.Series(data = my_data,index=labels))

display('-'*60)
display(pd.Series(arr,index=labels))

display('-'*60)
display(pd.Series(d))

0    10
1    20
2    30
dtype: int64

'------------------------------------------------------------'

a    10
b    20
c    30
dtype: int64

'------------------------------------------------------------'

a    10
b    20
c    30
dtype: int64

'------------------------------------------------------------'

a    10
b    20
c    30
dtype: int64

In [4]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Janpan'])
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Janpan'])
display(ser1,ser2)

USA        1
Germany    2
USSR       3
Janpan     4
dtype: int64

USA        1
Germany    2
Italy      5
Janpan     4
dtype: int64

In [5]:
ser1['USA']

1

In [6]:
ser1 + ser2

Germany    4.0
Italy      NaN
Janpan     8.0
USA        2.0
USSR       NaN
dtype: float64

# DataFrames Part1

In [7]:
from numpy.random import randn

In [8]:
np.random.seed(101)

In [9]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
# return a series
display(df['W'])
display(type(df['W']))

# return a list of columns
display(df[['W','Z']])

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

pandas.core.series.Series

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [11]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [12]:
# axis 1 reference to columns
# if inplace is true and the result will maintain
df.drop('new',axis=1,inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
# axis 1 reference to rows/index
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [14]:
df.shape

(5, 4)

In [15]:
# grab the row A
display(df.loc['A'])

# grab the row C
display(df.iloc[2])

display(df.loc['B','Y'])

display(df.loc[['B','C'],['W','Y']])

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

-0.8480769834036315

          W         Y
B  0.651118 -0.848077
C -2.018168  0.528813

In [16]:
display(df > 0)

display(df[df>0])

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
# return the rows when W has to be true
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
# return X of the rows when W has to be true
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [19]:
# mutilp conditions
df[(df['W']>0) & (df['Y']<0)]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [20]:
# the defulat of inplace is false 
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [21]:
newind = 'CA NY WY OR CO'.split(' ')

In [22]:
df['States'] = newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [23]:
display(df.set_index('States'))

# the defulat of inplace is false 
display(df)

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

# DataFrames Part2

In [24]:
# index levels
outside = ['G1','G1','G1','G2','G2','G2']
inside =[1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_idnex = pd.MultiIndex.from_tuples(hier_index)
hier_idnex

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [25]:
# create a mutilp level indexs
df = pd.DataFrame(randn(6,2),hier_idnex,['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [26]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [27]:
df.index.names = ['Group','Numbers']
df

                      A         B
Group Numbers
G1    1        0.302665  1.693723
      2       -1.706086 -1.159119
      3       -0.134841  0.390528
G2    1        0.166905  0.184502
      2        0.807706  0.072960
      3        0.638787  0.329646

In [28]:
# return value when the numbers is one on both groups
df.xs(1,level='Numbers')

              A         B
Group
G1     0.302665  1.693723
G2     0.166905  0.184502

# Missing Data

In [29]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [30]:
# drop the row at least one NaN value
display(df.dropna())

# drop the columns at least one NaN value
display(df.dropna(axis=1))

     A    B  C
0  1.0  5.0  1

   C
0  1
1  2
2  3

In [31]:
display(df.dropna(thresh=2))

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [32]:
df.fillna(value='FILL')

      A     B  C
0     1     5  1
1     2  FILL  2
2  FILL  FILL  3

In [33]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# GroupBy

In [34]:
data = {'Company':['GOOD','GOOD','MSFT','MSFT','FB','FB'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarch'],
        'Sales':[200,120,340,124,243,350]
}

In [35]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOD      Sam    200
1    GOOD  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarch    350

In [36]:
byCompany = df.groupby('Company')
byCompany

In [37]:
byCompany.mean()

         Sales
Company
FB       296.5
GOOD     160.0
MSFT     232.0

In [38]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [39]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarch    350
GOOD         Sam    200
MSFT     Vanessa    340

In [40]:
df.groupby('Company').describe().transpose()

Company              FB        GOOD        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [41]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

# Merging Joining and Concatenating

In [42]:
df1= pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']},
                   index =[0,1,2,3])

df2= pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7'],
                   'D':['D4','D5','D6','D7']},
                   index =[4,5,6,7])

df3= pd.DataFrame({'A':['A8','A9','A10','A11'],
                   'B':['B8','B9','B10','B11'],
                   'C':['C8','C9','C10','C11'],
                   'D':['D8','D9','D10','D11']},
                   index =[8,9,10,11])

In [43]:
display(df1,df2,df3)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [44]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [45]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

## Merge

In [46]:
left = pd.DataFrame({'Key':['K0','K1','K2','K3'],
                     'A':['A0','A1','A2','A3'],
                     'B':['B0','B1','B2','B3']})
                     
right = pd.DataFrame({'Key':['K0','K1','K2','K3'],
                      'C':['C4','C5','C6','C7'],
                      'D':['D4','D5','D6','D7']})

In [47]:
display(left, right)

pd.merge(left,right,how='inner',on='Key')

  Key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

  Key   C   D
0  K0  C4  D4
1  K1  C5  D5
2  K2  C6  D6
3  K3  C7  D7

  Key   A   B   C   D
0  K0  A0  B0  C4  D4
1  K1  A1  B1  C5  D5
2  K2  A2  B2  C6  D6
3  K3  A3  B3  C7  D7

In [48]:
left1 = pd.DataFrame({'Key1':['K0','K0','K1','K2'],
                      'Key2':['K0','K1','K0','K1'],
                      'A':['A0','A1','A2','A3'],
                      'B':['B0','B1','B2','B3']})
                     
right1 = pd.DataFrame({'Key1':['K0','K1','K1','K2'],
                       'Key2':['K0','K0','K0','K0'],
                       'C':['C0','C1','C2','C3'],
                       'D':['D0','D1','D2','D3']})

In [49]:
pd.merge(left1,right1,on=['Key1','Key2'])

  Key1 Key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [50]:
pd.merge(left1,right1,how='outer',on=['Key1','Key2'])

  Key1 Key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [51]:
pd.merge(left1,right1,how='left',on=['Key1','Key2'])

  Key1 Key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

## Join

In [52]:
left2 = pd.DataFrame({'A':['A0','A1','A2'],
                      'B':['B0','B1','B2']},
                      index= ['K0','K1','K2'])
                     
right2 = pd.DataFrame({'C':['C0','C2','C3'],
                       'D':['D0','D2','D3']},
                       index= ['K0','K2','K3'])

In [53]:
left2.join(right2)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [54]:
left2.join(right2,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# operations

In [55]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})

df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [56]:
# find the unique value
display(df['col2'].unique())

# count each value
display(df['col2'].value_counts())

array([444, 555, 666])

444    2
555    1
666    1
Name: col2, dtype: int64

In [57]:
# apply function
def times2(x):
    return x*2

df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [58]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [59]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [60]:
# inpalce is false
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [61]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [62]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [63]:
# sort by col2
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [64]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [65]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one',],
        'C':['x','y','x','y','x','y'],
        'D':[1,2,3,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  2
2  foo  two  x  3
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [66]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  2.0
    two  3.0  NaN

# Data input and output

* CSV
* Excel
* Html
* SQL

In [67]:
# df = pd.read_csv('')
# df.to_csv('',index=false)

In [68]:
import xlrd
# df = pd.read_excel('sample.xlsx',sheetname='sheet1')
# df.to_excel('sample.xlsx',sheetname='new_sheet')

In [69]:
# df = pd.read_html('http://....')

In [70]:
from sqlalchemy import create_engine

engine = create_engine('sqlite://:memory:')
# df = to_sql('my_table',engine)
# sqldf = pf.read_sql('my_table',con=engine)

ValueError: invalid literal for int() with base 10: 'memory:'